##### groupby() splits your data into groups based on some column(s), performs operations on each group independently, and then combines the result.

In [2]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data=data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [3]:
df.groupby('Company')['Sales'].mean()

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [4]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [23]:
data = {
    'department': ['Sales', 'Sales', 'HR', 'HR', 'IT'],
    'employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'salary': [70000, 80000, 60000, 62000, 90000]
}
df = pd.DataFrame(data)

df.groupby("department")["salary"].agg('mean')

department
HR       61000.0
IT       90000.0
Sales    75000.0
Name: salary, dtype: float64

In [36]:
#Another approach to do this one
df.groupby("department").agg({'salary' : 'mean'})

             salary
department
HR          61000.0
IT          90000.0
Sales       75000.0

In [41]:
#Another way of doing it by defining the column name 
df.groupby("department").agg(
    mean_salary = ("salary", "mean"),
    )

            mean_salary
department
HR              61000.0
IT              90000.0
Sales           75000.0

In [25]:
df.groupby(["department", "employee"])["salary"].agg(['mean', 'max', 'min'])

                        mean    max    min
department employee
HR         Charlie   60000.0  60000  60000
           David     62000.0  62000  62000
IT         Eve       90000.0  90000  90000
Sales      Alice     70000.0  70000  70000
           Bob       80000.0  80000  80000

In [16]:
# use the reset_index() to flattern then result
df.groupby(["department", "employee"])["salary"].agg(["mean", "max", "min"]).reset_index()

  department employee     mean    max    min
0         HR  Charlie  60000.0  60000  60000
1         HR    David  62000.0  62000  62000
2         IT      Eve  90000.0  90000  90000
3      Sales    Alice  70000.0  70000  70000
4      Sales      Bob  80000.0  80000  80000

In [50]:
#Find the department with max salary
df.groupby("department")["salary"].max().reset_index().sort_values(by="salary",ascending=False).iloc[0]

department       IT
salary        90000
Name: 1, dtype: object

In [18]:
def salary_range(x):
    return x.max() - x.min()

df.groupby("department")["salary"].apply(salary_range).reset_index()

  department  salary
0         HR    2000
1         IT       0
2      Sales   10000

In [29]:
df["bonus"] = [5000, 6000, 2000, 2500, 7000]
df.groupby("department")[["salary", "bonus"]].agg({
    "salary":"mean",
    "bonus" : "sum"
})

             salary  bonus
department
HR          61000.0   4500
IT          90000.0   7000
Sales       75000.0  11000

In [37]:
df.groupby("department").agg({
    "salary":"mean",
    "bonus" : "sum"
})

             salary  bonus
department
HR          61000.0   4500
IT          90000.0   7000
Sales       75000.0  11000

In [40]:
#Another way of doing it by defining the column name 
df.groupby("department").agg(
    mean_salary = ("salary", "mean"),
    total_bonus = ("bonus", "sum"))

            mean_salary  total_bonus
department
HR              61000.0         4500
IT              90000.0         7000
Sales           75000.0        11000